@alesstimec I followed your reproducer but failed to reproduce this, I suppose either this is an intermittent issue, or we need more info. Here's the output that I see:

This is with:
- terraform v1.8.4-dev from snap.
- juju 3.4.2 from snap.
- On microK8s v1.29.5 from snap


```terraform
$ terraform apply
data.juju_offer.sink: Reading...
data.juju_offer.sink: Read complete after 0s [id=admin/b.dummy-source]

Terraform used the selected providers to generate the following execution plan. Resource
actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # juju_application.a will be created
  + resource "juju_application" "a" {
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "a"
      + name        = "a"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + trust       = false
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = (known after apply)
          + name     = "juju-qa-dummy-sink"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

  # juju_integration.a will be created
  + resource "juju_integration" "a" {
      + id    = (known after apply)
      + model = "a"
      + via   = "127.0.0.1/32,127.0.0.3/32"

      + application {
          + endpoint = "source"
          + name     = "a"
        }
      + application {
          + endpoint  = (known after apply)
          + offer_url = "admin/b.dummy-source"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

juju_application.a: Creating...
juju_application.a: Creation complete after 1s [id=a:a]
juju_integration.a: Creating...
juju_integration.a: Creation complete after 5s [id=a:a:source:dummy-source:sink]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```